load-tests/employee-flow.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 20
      arrivalRate: 2
      name: "Empleados operando el sistema"
      
  variables:
    businessId: "b83e418f-10aa-41c8-b37a-834d97d1b942"
    # IMPORTANTE: Reemplazar con credenciales válidas de un empleado de prueba
    email: "juanchos@gmial.com"
    password: "123456"

scenarios:
  - name: "Flujo del Empleado - Operación completa de cita"
    flow:
      # 1. Iniciar sesión
      - post:
          url: "/api/auth/login"
          json:
            email: "{{ email }}"
            password: "{{ password }}"
          capture:
            - json: "$.token"
              as: "token"
              
      # 2. Ver sus citas asignadas
      - get:
          url: "/api/appointments/my"
          headers:
            Authorization: "Bearer {{ token }}"
          capture:
            - json: "$[0].id"
              as: "appointmentId"

      # 3. Confirmar la cita (Solo si existe appointmentId)
      - patch:
          url: "/api/appointments/{{ appointmentId }}/status"
          ifTrue: "appointmentId"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            status: "confirmed"
      
      - think: 2
      
      # 4. Cambiar a "En Atención" (atender)
      - patch:
          url: "/api/appointments/{{ appointmentId }}/status"
          ifTrue: "appointmentId"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            status: "attention"
      
      # 5. Agregar una nota técnica
      - post:
          url: "/api/appointments/{{ appointmentId }}/notes"
          ifTrue: "appointmentId"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            content: "Nota de prueba durante el stress test"
            
      # 6. Agregar cargo adicional (adicional)
      - patch:
          url: "/api/appointments/{{ appointmentId }}/additional-charge"
          ifTrue: "appointmentId"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            additionalAmount: 5000
            additionalNote: "Cargo extra por insumos"
      
      # 7. Extender tiempo (extender tiempo)
      - patch:
          url: "/api/appointments/{{ appointmentId }}/extend-time"
          ifTrue: "appointmentId"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            additionalMinutes: 15
      
      - think: 3
      
      # 8. Finalizar la cita (terminar)
      - patch:
          url: "/api/appointments/{{ appointmentId }}/status"
          ifTrue: "appointmentId"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            status: "done"
            paymentMethod: "cash"