load-tests/stress-client.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 20
      arrivalRate: 2
      name: "Calentamiento"
    - duration: 40
      arrivalRate: 10
      name: "Carga Sostenida"

  variables:
    businessId: "cd91baa7-f46b-4365-934d-3d9fcf18fc53"
    serviceId: "f8e64b5f-fb05-4b77-8c64-c7724267b0fa"
    employeeId: "2d150c09-d2ec-4681-b5c8-42a8574a4f07"

  processor: "./helpers.js"

scenarios:
  - name: "Flujo del Cliente - Agendar Cita"
    flow:
      - get:
          url: "/api/businesses/by-id/{{ businessId }}/public"
      - get:
          url: "/api/services/business/{{ businessId }}"
      - think: 1
      - post:
          url: "/api/appointments"
          beforeRequest: "generateFakeAppointmentData"
          json:
            businessId: "{{ businessId }}"
            serviceId: "{{ serviceId }}"
            employeeId: "{{ employeeId }}"
            clientName: "{{ fakeName }}"
            clientPhone: "{{ fakePhone }}"
            address: "Av. Siempre Viva 742"
            startTime: "{{ fakeStartTime }}"
            status: "attention"
          expect:
            - statusCode: 201